{
    "_name_or_path": "AutoTrain",
    "architectures": [
      "SwinForImageClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "depths": [
      2,
      2,
      18,
      2
    ],
    "drop_path_rate": 0.1,
    "embed_dim": 128,
    "encoder_stride": 32,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 1024,
    "id2label": {
      "0": "\u3078\u30a4\u30e9\u30c3\u30b7\u30e3",
      "1": "\u30a2\u30de\u30fc\u30b8\u30e7",
      "10": "\u30a6\u30eb\u30ac\u30e2\u30b9",
      "11": "\u30a8\u30fc\u30d5\u30a3",
      "12": "\u30aa\u30c8\u30b7\u30c9\u30ea",
      "13": "\u30aa\u30ce\u30ce\u30af\u30b9",
      "14": "\u30aa\u30ea\u30fc\u30f4\u30a1",
      "15": "\u30aa\u30fc\u30ed\u30f3\u30b2",
      "16": "\u30ab\u30a4\u30ea\u30e5\u30fc",
      "17": "\u30ab\u30c3\u30c8\u30ed\u30c8\u30e0",
      "18": "\u30ab\u30d0\u30eb\u30c9\u30f3",
      "19": "\u30ab\u30e9\u30df\u30f3\u30b4",
      "2": "\u30a2\u30e9\u30d6\u30eb\u30bf\u30b1",
      "20": "\u30ac\u30d6\u30ea\u30a2\u30b9",
      "21": "\u30ad\u30ce\u30ac\u30c3\u30b5",
      "22": "\u30ad\u30e7\u30b8\u30aa\u30fc\u30f3",
      "23": "\u30ad\u30e9\u30d5\u30ed\u30eb",
      "24": "\u30ae\u30e3\u30e9\u30c9\u30b9",
      "25": "\u30af\u30a8\u30b9\u30d1\u30c8\u30e9",
      "26": "\u30b0\u30ec\u30f3\u30a2\u30eb\u30de",
      "27": "\u30b2\u30f3\u30ac\u30fc",
      "28": "\u30b3\u30ce\u30e8\u30b6\u30eb",
      "29": "\u30b3\u30fc\u30bf\u30b9",
      "3": "\u30a2\u30fc\u30de\u30fc\u30ac\u30a2",
      "30": "\u30b5\u30b1\u30d6\u30b7\u30c3\u30dd",
      "31": "\u30b5\u30b6\u30f3\u30c9\u30e9",
      "32": "\u30b5\u30fc\u30ca\u30a4\u30c8",
      "33": "\u30b5\u30fc\u30d5\u30b4\u30fc",
      "34": "\u30b7\u30e3\u30ef\u30fc\u30ba",
      "35": "\u30b8\u30d0\u30b3\u30a4\u30eb",
      "36": "\u30b9\u30c8\u30ea\u30f3\u30c0\u30fc",
      "37": "\u30b9\u30ca\u30ce\u30b1\u30ac\u30ef",
      "38": "\u30bb\u30b0\u30ec\u30a4\u30d6",
      "39": "\u30bd\u30a6\u30d6\u30ec\u30a4\u30ba",
      "4": "\u30a4\u30c0\u30a4\u30ca\u30ad\u30d0",
      "40": "\u30be\u30ed\u30a2\u30fc\u30af",
      "41": "\u30bf\u30a4\u30ab\u30a4\u30c7\u30f3",
      "42": "\u30bf\u30ae\u30f3\u30b0\u30eb",
      "43": "\u30c1\u30e3\u30fc\u30ec\u30e0",
      "44": "\u30c6\u30c4\u30ce\u30ab\u30a4\u30ca",
      "45": "\u30c6\u30c4\u30ce\u30c4\u30c4\u30df",
      "46": "\u30c6\u30c4\u30ce\u30c9\u30af\u30ac",
      "47": "\u30c6\u30c4\u30ce\u30d6\u30b8\u30f3",
      "48": "\u30c6\u30c4\u30ce\u30ef\u30c0\u30c1",
      "49": "\u30c7\u30a3\u30f3\u30eb\u30fc",
      "5": "\u30a4\u30eb\u30ab\u30de\u30f3",
      "50": "\u30c7\u30ab\u30cc\u30c1\u30e3\u30f3",
      "51": "\u30c8\u30c9\u30ed\u30af\u30c4\u30ad",
      "52": "\u30c8\u30ea\u30c8\u30c9\u30f3",
      "53": "\u30c9\u30aa\u30fc",
      "54": "\u30c9\u30c9\u30b2\u30b6\u30f3",
      "55": "\u30c9\u30d2\u30c9\u30a4\u30c7",
      "56": "\u30c9\u30e9\u30d1\u30eb\u30c8",
      "57": "\u30cb\u30f3\u30d5\u30a3\u30a2",
      "58": "\u30cc\u30e1\u30eb\u30b4\u30f3",
      "59": "\u30ce\u30b3\u30b3\u30c3\u30c1",
      "6": "\u30a4\u30fc\u30e6\u30a4",
      "60": "\u30cf\u30ab\u30c9\u30c3\u30b0",
      "61": "\u30cf\u30c3\u30b5\u30e0",
      "62": "\u30cf\u30d0\u30bf\u30af\u30ab\u30df",
      "63": "\u30cf\u30d4\u30ca\u30b9",
      "64": "\u30cf\u30e9\u30d0\u30ea\u30fc",
      "65": "\u30cf\u30eb\u30af\u30b8\u30e9",
      "66": "\u30d0\u30f3\u30ae\u30e9\u30b9",
      "67": "\u30d0\u30f3\u30d0\u30c9\u30ed",
      "68": "\u30d1\u30aa\u30b8\u30a2\u30f3",
      "69": "\u30d1\u30eb\u30b7\u30a7\u30f3",
      "7": "\u30a6\u30a4\u30f3\u30c7\u30a3",
      "70": "\u30d1\u30eb\u30c7\u30a2\u30b1\u30f3\u30bf\u30ed\u30b9\u6c34",
      "71": "\u30d1\u30fc\u30e2\u30c3\u30c8",
      "72": "\u30d2\u30fc\u30c8\u30ed\u30c8\u30e0",
      "73": "\u30d4\u30ab\u30c1\u30e5\u30a6",
      "74": "\u30d5\u30a9\u30ec\u30c8\u30b9",
      "75": "\u30d5\u30ef\u30e9\u30a4\u30c9",
      "76": "\u30d6\u30e9\u30c3\u30ad\u30fc",
      "77": "\u30d8\u30a4\u30e9\u30c3\u30b7\u30e3",
      "78": "\u30da\u30ea\u30c3\u30d1\u30fc",
      "79": "\u30de\u30b9\u30ab\u30fc\u30cb\u30e3",
      "8": "\u30a6\u30a7\u30fc\u30cb\u30d0\u30eb",
      "80": "\u30de\u30ea\u30eb\u30ea",
      "81": "\u30df\u30df\u30ba\u30ba",
      "82": "\u30df\u30df\u30c3\u30ad\u30e5",
      "83": "\u30e0\u30af\u30db\u30fc\u30af",
      "84": "\u30e1\u30bf\u30e2\u30f3",
      "85": "\u30e2\u30ed\u30d0\u30ec\u30eb",
      "86": "\u30e4\u30df\u30e9\u30df",
      "87": "\u30e9\u30a4\u30c1\u30e5\u30a6",
      "88": "\u30e9\u30a6\u30c9\u30dc\u30fc\u30f3",
      "89": "\u30ea\u30f3\u30b0\u30de",
      "9": "\u30a6\u30a9\u30c3\u30b7\u30e5\u30ed\u30c8\u30e0",
      "90": "\u30eb\u30ab\u30ea\u30aa",
      "91": "\u30eb\u30ac\u30eb\u30ac\u30f3\u305f\u305d\u304c\u308c",
      "92": "\u30eb\u30c1\u30e3\u30d6\u30eb"
    },
    "image_size": 224,
    "initializer_range": 0.02,
    "label2id": {
      "\u3078\u30a4\u30e9\u30c3\u30b7\u30e3": "0",
      "\u30a2\u30de\u30fc\u30b8\u30e7": "1",
      "\u30a2\u30e9\u30d6\u30eb\u30bf\u30b1": "2",
      "\u30a2\u30fc\u30de\u30fc\u30ac\u30a2": "3",
      "\u30a4\u30c0\u30a4\u30ca\u30ad\u30d0": "4",
      "\u30a4\u30eb\u30ab\u30de\u30f3": "5",
      "\u30a4\u30fc\u30e6\u30a4": "6",
      "\u30a6\u30a4\u30f3\u30c7\u30a3": "7",
      "\u30a6\u30a7\u30fc\u30cb\u30d0\u30eb": "8",
      "\u30a6\u30a9\u30c3\u30b7\u30e5\u30ed\u30c8\u30e0": "9",
      "\u30a6\u30eb\u30ac\u30e2\u30b9": "10",
      "\u30a8\u30fc\u30d5\u30a3": "11",
      "\u30aa\u30c8\u30b7\u30c9\u30ea": "12",
      "\u30aa\u30ce\u30ce\u30af\u30b9": "13",
      "\u30aa\u30ea\u30fc\u30f4\u30a1": "14",
      "\u30aa\u30fc\u30ed\u30f3\u30b2": "15",
      "\u30ab\u30a4\u30ea\u30e5\u30fc": "16",
      "\u30ab\u30c3\u30c8\u30ed\u30c8\u30e0": "17",
      "\u30ab\u30d0\u30eb\u30c9\u30f3": "18",
      "\u30ab\u30e9\u30df\u30f3\u30b4": "19",
      "\u30ac\u30d6\u30ea\u30a2\u30b9": "20",
      "\u30ad\u30ce\u30ac\u30c3\u30b5": "21",
      "\u30ad\u30e7\u30b8\u30aa\u30fc\u30f3": "22",
      "\u30ad\u30e9\u30d5\u30ed\u30eb": "23",
      "\u30ae\u30e3\u30e9\u30c9\u30b9": "24",
      "\u30af\u30a8\u30b9\u30d1\u30c8\u30e9": "25",
      "\u30b0\u30ec\u30f3\u30a2\u30eb\u30de": "26",
      "\u30b2\u30f3\u30ac\u30fc": "27",
      "\u30b3\u30ce\u30e8\u30b6\u30eb": "28",
      "\u30b3\u30fc\u30bf\u30b9": "29",
      "\u30b5\u30b1\u30d6\u30b7\u30c3\u30dd": "30",
      "\u30b5\u30b6\u30f3\u30c9\u30e9": "31",
      "\u30b5\u30fc\u30ca\u30a4\u30c8": "32",
      "\u30b5\u30fc\u30d5\u30b4\u30fc": "33",
      "\u30b7\u30e3\u30ef\u30fc\u30ba": "34",
      "\u30b8\u30d0\u30b3\u30a4\u30eb": "35",
      "\u30b9\u30c8\u30ea\u30f3\u30c0\u30fc": "36",
      "\u30b9\u30ca\u30ce\u30b1\u30ac\u30ef": "37",
      "\u30bb\u30b0\u30ec\u30a4\u30d6": "38",
      "\u30bd\u30a6\u30d6\u30ec\u30a4\u30ba": "39",
      "\u30be\u30ed\u30a2\u30fc\u30af": "40",
      "\u30bf\u30a4\u30ab\u30a4\u30c7\u30f3": "41",
      "\u30bf\u30ae\u30f3\u30b0\u30eb": "42",
      "\u30c1\u30e3\u30fc\u30ec\u30e0": "43",
      "\u30c6\u30c4\u30ce\u30ab\u30a4\u30ca": "44",
      "\u30c6\u30c4\u30ce\u30c4\u30c4\u30df": "45",
      "\u30c6\u30c4\u30ce\u30c9\u30af\u30ac": "46",
      "\u30c6\u30c4\u30ce\u30d6\u30b8\u30f3": "47",
      "\u30c6\u30c4\u30ce\u30ef\u30c0\u30c1": "48",
      "\u30c7\u30a3\u30f3\u30eb\u30fc": "49",
      "\u30c7\u30ab\u30cc\u30c1\u30e3\u30f3": "50",
      "\u30c8\u30c9\u30ed\u30af\u30c4\u30ad": "51",
      "\u30c8\u30ea\u30c8\u30c9\u30f3": "52",
      "\u30c9\u30aa\u30fc": "53",
      "\u30c9\u30c9\u30b2\u30b6\u30f3": "54",
      "\u30c9\u30d2\u30c9\u30a4\u30c7": "55",
      "\u30c9\u30e9\u30d1\u30eb\u30c8": "56",
      "\u30cb\u30f3\u30d5\u30a3\u30a2": "57",
      "\u30cc\u30e1\u30eb\u30b4\u30f3": "58",
      "\u30ce\u30b3\u30b3\u30c3\u30c1": "59",
      "\u30cf\u30ab\u30c9\u30c3\u30b0": "60",
      "\u30cf\u30c3\u30b5\u30e0": "61",
      "\u30cf\u30d0\u30bf\u30af\u30ab\u30df": "62",
      "\u30cf\u30d4\u30ca\u30b9": "63",
      "\u30cf\u30e9\u30d0\u30ea\u30fc": "64",
      "\u30cf\u30eb\u30af\u30b8\u30e9": "65",
      "\u30d0\u30f3\u30ae\u30e9\u30b9": "66",
      "\u30d0\u30f3\u30d0\u30c9\u30ed": "67",
      "\u30d1\u30aa\u30b8\u30a2\u30f3": "68",
      "\u30d1\u30eb\u30b7\u30a7\u30f3": "69",
      "\u30d1\u30eb\u30c7\u30a2\u30b1\u30f3\u30bf\u30ed\u30b9\u6c34": "70",
      "\u30d1\u30fc\u30e2\u30c3\u30c8": "71",
      "\u30d2\u30fc\u30c8\u30ed\u30c8\u30e0": "72",
      "\u30d4\u30ab\u30c1\u30e5\u30a6": "73",
      "\u30d5\u30a9\u30ec\u30c8\u30b9": "74",
      "\u30d5\u30ef\u30e9\u30a4\u30c9": "75",
      "\u30d6\u30e9\u30c3\u30ad\u30fc": "76",
      "\u30d8\u30a4\u30e9\u30c3\u30b7\u30e3": "77",
      "\u30da\u30ea\u30c3\u30d1\u30fc": "78",
      "\u30de\u30b9\u30ab\u30fc\u30cb\u30e3": "79",
      "\u30de\u30ea\u30eb\u30ea": "80",
      "\u30df\u30df\u30ba\u30ba": "81",
      "\u30df\u30df\u30c3\u30ad\u30e5": "82",
      "\u30e0\u30af\u30db\u30fc\u30af": "83",
      "\u30e1\u30bf\u30e2\u30f3": "84",
      "\u30e2\u30ed\u30d0\u30ec\u30eb": "85",
      "\u30e4\u30df\u30e9\u30df": "86",
      "\u30e9\u30a4\u30c1\u30e5\u30a6": "87",
      "\u30e9\u30a6\u30c9\u30dc\u30fc\u30f3": "88",
      "\u30ea\u30f3\u30b0\u30de": "89",
      "\u30eb\u30ab\u30ea\u30aa": "90",
      "\u30eb\u30ac\u30eb\u30ac\u30f3\u305f\u305d\u304c\u308c": "91",
      "\u30eb\u30c1\u30e3\u30d6\u30eb": "92"
    },
    "layer_norm_eps": 1e-05,
    "max_length": 128,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "num_channels": 3,
    "num_heads": [
      4,
      8,
      16,
      32
    ],
    "num_layers": 4,
    "padding": "max_length",
    "patch_size": 4,
    "path_norm": true,
    "problem_type": "single_label_classification",
    "qkv_bias": true,
    "torch_dtype": "float32",
    "transformers_version": "4.25.1",
    "use_absolute_embeddings": false,
    "window_size": 7
  }
